packages/HPPPM/HPPPM-0.1.tar.gz/HPPPM-0.1/hpppm/templates/addRequestNotes.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:common="http://mercury.com/ppm/common/1.0" xmlns:dm="http://mercury.com/ppm/dm/1.0" xmlns:ds="http://mercury.com/ppm/dm/service/1.0">
<soap:Header>
<wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-424bffbd-a471-471b-94bd-81d12f4019ff">
<wsse:Username>{{ USER }}</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{ PASSWORD }}</wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</soap:Header>
<soap:Body>
<ds:addRequestNotes>
<ds:requestId>
<dm:id>{{ requestId.0 }}</dm:id>
{% if requestId.1 is defined -%}
<dm:serverURL>{{ requestId.1 }}</dm:serverURL>
{% endif -%}
</ds:requestId>
<ds:notes>
{% if notes|length == 1 -%}
<common:creationDate>{{ DATETIME }}</common:creationDate>
<common:content>{{ notes.0 }}</common:content>
{% elif notes|length == 2 -%}
<common:author>{{ notes.0 }}</common:author>
<common:creationDate>{{ DATETIME }}</common:creationDate>
<common:content>{{ notes.1 }}</common:content>
{% endif -%}
</ds:notes>
</ds:addRequestNotes>
</soap:Body>
</soap:Envelope>
