packages/HPPPM/HPPPM-0.1-py2.4.egg/hpppm/templates/setRequestRemoteReferenceStatus.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header>
<wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-424bffbd-a471-471b-94bd-81d12f4019ff">
<wsse:Username>{{ USER }}</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{ PASSWORD }}</wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</soap:Header>
<soap:Body>
<ds:setRequestRemoteReferenceStatus xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:common="http://mercury.com/ppm/common/1.0" xmlns:dm="http://mercury.com/ppm/dm/1.0" xmlns:ds="http://mercury.com/ppm/dm/service/1.0">
<ds:receiver>
<dm:id>{{ receiver.0 }}</dm:id>
<dm:serverURL>{{ receiver.1 }}</dm:serverURL>
</ds:receiver>
<ds:source>
<dm:id>{{ source.0 }}</dm:id>
<dm:serverURL>{{ source.1 }}</dm:serverURL>
</ds:source>
<ds:status>{{ status.0 }}</ds:status>
{%- for field in fields -%}
{% if loop.index0 is divisibleby 2 -%}
<ds:fields>
<common:token>{{ field }}</common:token>
{% else -%}
<dm:stringValue>{{ field }}</dm:stringValue>
<dm:dateValue>{{ DATETIME }}</dm:dateValue>
</ds:fields>
{% endif -%}
{%- endfor -%}
</ds:setRequestRemoteReferenceStatus>
</soap:Body>
</soap:Envelope>
